{
  "id": "8c34065d-e8c3-4e2d-9f11-b164e13f18da",
  "siteName": "LegalAssist",
  "domainUrl": "legalconfer.com",
  "brandingPresets": [
    {
      "presetId": "0079631d-84b2-4f48-9303-aab170f0220b",
      "brandIdentity": {
        "designSummary": "This design features a modern classic aesthetic with editorial influences, characterized by a clean, spacious layout and a warm, earthy color palette. The primary colors include a rich burnt orange and deep brown, paired with soft off-white backgrounds and subtle pastel accents. Typography is dominated by elegant serif fonts for headings and complementary serif or serif-inspired fonts for body text, creating a refined and readable hierarchy. The layout employs generous whitespace, modular grids, and balanced text-image relationships, fostering a calm and uncluttered user experience. UI components such as buttons and containers use solid, warm colors to highlight calls to action while maintaining a minimalist and sophisticated style. Overall, the design conveys quality, trust, and comfort, making it adaptable for various premium industries.",
        "toneOfVoice": "warm, trustworthy, sophisticated, and inviting with a professional yet approachable personality.",
        "tones": [
          "Warm",
          "Trustworthy",
          "Sophisticated",
          "Inviting",
          "Calm",
          "Elegant",
          "Professional",
          "Approachable",
          "Clean",
          "Spacious"
        ],
        "designStyle": {
          "primaryStyle": [
            "Modern Classic",
            "Editorial"
          ],
          "supportingStyles": [
            "Minimalism",
            "Warm Naturalism"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#B94A1F",
            "primaryForeground": "#FFFFFF",
            "secondary": "#4A2C23",
            "secondaryForeground": "#F9F5F0",
            "background": "#F9F5F0",
            "customColors": [
              {
                "name": "pastellavender",
                "value": "#D6D0DD"
              },
              {
                "name": "pastelbeige",
                "value": "#E6D6C4"
              },
              {
                "name": "pastelgreen",
                "value": "#DCE6CD"
              },
              {
                "name": "pastelpeach",
                "value": "#F7BFA6"
              },
              {
                "name": "foreground",
                "value": "#4A2C23"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color for key interactive elements such as buttons, links, and highlights to draw user attention effectively. The 'primaryForeground' color ensures text and icons on 'primary' backgrounds remain highly legible. The 'secondary' color is ideal for headings, subheadings, and important text elements, paired with 'secondaryForeground' for contrast and readability. The 'background' color provides a soft, neutral canvas that supports content without distraction. The custom colors 'pastelLavender', 'pastelBeige', 'pastelGreen', and 'pastelPeach' serve as subtle accent blocks or backgrounds for data visualization and highlight sections, adding warmth and variety while maintaining harmony with the core palette. These colors should be used sparingly to maintain a clean and sophisticated look. Overall, the palette balances warmth and professionalism, ensuring accessibility and visual comfort across the site.",
          "paletteAccessibilityNotes": "The 'primary' color on 'primaryForeground' (white) meets WCAG AA and AAA contrast standards for text and UI elements, ensuring readability. The 'secondary' color on 'secondaryForeground' also meets WCAG AA contrast ratios for headings and important text. The 'background' color provides sufficient contrast with both 'primary' and 'secondary' text colors for body content. Custom pastel colors have moderate contrast and are best used for large text or non-critical UI elements to maintain accessibility. Overall, the palette supports strong visual hierarchy and accessibility compliance."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "didot-w01-italic"
            ],
            "headingsUsageGuide": "Use the 'bitter' font for all primary headings to convey elegance and professionalism. Headings should be large with generous line height and spacing to enhance readability and create a strong visual hierarchy. Pair headings with body text fonts that complement serif styles for balance. Use the 'secondary' color for headings to maintain contrast and brand consistency. Avoid overcrowding headings with excessive weight or size to preserve the clean aesthetic.",
            "headingsAccessibilityNotes": "Headings in 'bitter' paired with the 'secondary' color on the 'background' color meet WCAG AA contrast standards, ensuring clear readability for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "raleway",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "noto",
              "open sans",
              "nunito sans"
            ],
            "paragraphsUsageGuide": "Use the 'raleway' font for body text to maintain typographic harmony with headings. Body text should be set at a comfortable size with moderate line height for easy reading. Use the 'secondary' color for body text on the 'background' color to ensure sufficient contrast. Maintain consistent spacing between paragraphs and sections to support a clean, uncluttered layout. Avoid overly dense text blocks to preserve the spacious feel of the design.",
            "paragraphsAccessibilityNotes": "Body text in 'raleway' with the 'secondary' color on the 'background' color meets WCAG AA contrast requirements, supporting accessibility for all users."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section typography is anchored in the top third of the hero image area, with large, elegant headings placed on a semi-opaque background block. This placement ensures immediate visual impact and readability against the photographic backdrop. The heading uses a large serif font with ample spacing, while the supporting text is smaller and more subdued, creating a clear hierarchy. The call-to-action button is positioned below the text block, using the 'primary' color to stand out. This approach balances visual prominence with clarity, guiding the user's focus naturally from headline to action."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Moderate Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use soft background colors or subtle pastel blocks to separate content sections, maintaining a clean and elegant look. Borders are minimal or absent, relying on spacing and color contrast for separation. The 'background' color predominates, with custom pastel colors used sparingly for emphasis.",
          "images": "Images are large, high-quality, and naturalistic, often spanning full width or large columns. They are framed by generous whitespace and rarely overlapped by text except in hero sections with semi-opaque overlays. The style is warm and inviting, supporting the brand's premium feel.",
          "buttons": "Buttons are solid blocks of the 'primary' color with 'primaryForeground' text, featuring clean edges and moderate padding. Secondary buttons use a subtle background or border with the 'primary' color for text or outlines. Buttons have clear hover states and are sized for easy interaction."
        },
        "graphicElements": {
          "icons": "Icons are minimal, line-based, and use the 'secondary' color to maintain subtlety and elegance. They support navigation and UI without drawing excessive attention.",
          "illustrations": "No prominent illustrations are used, maintaining a photographic and realistic visual style.",
          "stickers": "No stickers or badges are present, preserving the clean and professional aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750574994718-Screenshot%202025-06-22%20at%209.49.48.png"
      ]
    },
    {
      "presetId": "71ea0dab-ab2b-48e6-8153-743280ba2e78",
      "brandIdentity": {
        "designSummary": "This brand identity embraces a monochrome, high-contrast visual style centered on a black background with white foreground elements. The design is minimalistic yet refined, featuring classic serif typography with elegant, high-contrast letterforms that convey sophistication and timelessness. The layout is spacious and balanced, employing generous negative space and a modular grid system to create a clean, editorial aesthetic. Image cards are presented with subtle rotation and rounded corners, adding a dynamic and artistic flair without disrupting the overall minimalism. UI components such as buttons and testimonial containers maintain the monochrome palette with white text and thin white borders, reinforcing the brand's elegant and luxurious tone. This design language is versatile for premium service websites that seek to communicate intimacy, trust, and refinement through a restrained yet impactful visual approach.",
        "toneOfVoice": "Sophisticated, elegant, refined, and trustworthy with a timeless and classic personality.",
        "tones": [
          "Elegant",
          "Sophisticated",
          "Minimalistic",
          "Refined",
          "Timeless",
          "Luxurious",
          "Intimate",
          "Trustworthy",
          "Clean",
          "High-Contrast"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Editorial",
            "Classic"
          ],
          "supportingStyles": [
            "Modern",
            "Luxury",
            "Monochrome"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#FFFFFF",
            "secondaryForeground": "#000000",
            "background": "#000000",
            "customColors": [
              {
                "name": "foreground",
                "value": "#FFFFFF"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' black color as the dominant background to create a dramatic and elegant canvas. The 'primaryForeground' white color is used for all text, icons, and UI elements to ensure maximum readability and high contrast. The 'secondary' white color can be used for backgrounds of cards or containers, with 'secondaryForeground' black used for text within those containers to maintain contrast and legibility. This strict monochrome palette supports a timeless and sophisticated brand presence, with careful use of negative space and typography to create visual hierarchy and focus. Avoid introducing additional colors to preserve the minimalistic and editorial tone.",
          "paletteAccessibilityNotes": "The combination of 'primary' black background with 'primaryForeground' white text provides excellent WCAG AA and AAA contrast ratios, ensuring accessibility for all users. Similarly, 'secondary' white backgrounds with 'secondaryForeground' black text also meet high accessibility standards. This palette supports clear readability and user comfort across all text sizes and UI elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "didot-w01-italic",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "baskervillemtw01-smbdit",
              "bodoni-w01-poster",
              "playfair display"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to convey elegance and refinement. Pair with the paragraph font to create a clear typographic hierarchy. Maintain ample spacing around headings to enhance readability and visual impact. The italic style adds a classic, editorial feel that complements the monochrome palette. Ensure headings are always displayed in 'primaryForeground' color on 'primary' background or 'secondaryForeground' on 'secondary' backgrounds for optimal contrast.",
            "headingsAccessibilityNotes": "Headings in 'primaryForeground' on 'primary' background and 'secondaryForeground' on 'secondary' background meet WCAG AA contrast requirements, ensuring legibility for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "baskervillemtw01-smbdit",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "didot-w01-italic",
              "playfair display",
              "cormorantgaramond"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text and smaller informational content. It pairs harmoniously with the heading font to maintain a consistent, elegant typographic voice. Maintain sufficient line height and letter spacing to enhance readability, especially on black backgrounds. Text should always be in 'primaryForeground' on 'primary' background or 'secondaryForeground' on 'secondary' backgrounds to ensure accessibility and visual clarity.",
            "paragraphsAccessibilityNotes": "Body text colors and backgrounds meet WCAG AA contrast standards, supporting comfortable reading experiences for all users."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section typography is centrally aligned, creating a strong focal point. Large, elegant serif headings dominate the space, with ample negative space around them to emphasize their importance. The text is placed on a solid black background with white foreground text, ensuring maximum contrast and readability. This placement strategy reinforces the brand's sophisticated and timeless personality, drawing the visitor's attention immediately upon landing."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "400"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "400"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "400"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "400"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "400"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "400"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "400"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid 'secondary' white backgrounds with rounded corners and subtle shadows to create separation from the 'primary' black background. This enhances content focus while maintaining the monochrome palette. Padding is consistent to ensure content clarity and breathing room.",
          "images": "Images are presented in cards with rounded corners and slight rotation for a dynamic, artistic effect. They are framed by white backgrounds to contrast against the black page background, emphasizing the content without adding color distractions.",
          "buttons": "Buttons are minimalistic with thin white borders and white text on a black background. On hover or focus, subtle changes in opacity or border thickness may be used to indicate interactivity, maintaining the monochrome aesthetic."
        },
        "graphicElements": {
          "icons": "Icons, if used, are simple line or solid white shapes consistent with the monochrome palette, ensuring they do not detract from the typography and imagery.",
          "illustrations": "No illustrations are present; the design relies on photography and typography for visual interest.",
          "stickers": "No stickers or badges are used, preserving the clean and elegant visual style."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750173227756-Group%201000002200.jpg"
      ]
    },
    {
      "presetId": "e4b7b7c7-787d-4056-8361-b6ebff6972cc",
      "brandIdentity": {
        "designSummary": "This design features a warm, earthy color palette dominated by a rich burnt orange as the primary color, paired with a soft off-white background that creates a gentle contrast. The typography combines elegant serif fonts for headings with clean, modern sans-serif fonts for body and UI text, establishing a refined yet accessible tone. The layout is grid-based and modular, balancing structured alignment with generous white space for clarity and ease of navigation. UI elements such as buttons and borders use the primary color for emphasis with minimalistic line styles, supporting a contemporary and confident aesthetic. Overall, the design blends modern minimalism with classic editorial influences, resulting in a professional, inviting, and trustworthy brand presence suitable for a variety of industries seeking warmth and sophistication.",
        "toneOfVoice": "Professional, warm, trustworthy, and sophisticated with a modern and approachable personality.",
        "tones": [
          "warm",
          "professional",
          "trustworthy",
          "sophisticated",
          "minimal",
          "inviting",
          "modern",
          "refined",
          "balanced",
          "clean"
        ],
        "designStyle": {
          "primaryStyle": [
            "Modern Minimalism",
            "Editorial"
          ],
          "supportingStyles": [
            "Warm Earthy",
            "Professional"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#A8511E",
            "primaryForeground": "#FFFFFF",
            "secondary": "#F9F7F3",
            "secondaryForeground": "#1A1A1A",
            "background": "#F9F7F3",
            "customColors": [
              {
                "name": "foreground",
                "value": "#A8511E"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color predominantly for backgrounds of key sections, buttons, borders, and text highlights to create a strong brand presence. The 'primaryForeground' color should be used for text and icons placed on 'primary' backgrounds to ensure clear readability. The 'secondary' color serves as the main background for the site, providing a soft, neutral canvas that balances the warmth of the 'primary' color. Use 'secondaryForeground' for body text and UI elements on the 'secondary' background to maintain high contrast and legibility. This palette supports a warm, inviting atmosphere while maintaining professionalism and clarity. Avoid mixing 'primary' and 'secondary' colors in close proximity without sufficient spacing to preserve visual hierarchy and accessibility.",
          "paletteAccessibilityNotes": "The combination of 'primary' (#A8511E) with 'primaryForeground' (#FFFFFF) meets WCAG AA standards for text and UI elements, ensuring sufficient contrast. The 'secondary' (#EDE8E1) background with 'secondaryForeground' (#1A1A1A) text also meets WCAG AA contrast requirements for body text and smaller UI elements. The 'background' (#F9F7F3) provides a subtle contrast with 'secondaryForeground' for large text blocks, supporting comfortable reading. Overall, the palette is designed to maintain accessibility across all text and interactive elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "playfair display",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "bitter",
              "cormorantgaramond",
              "didot-w01-italic"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to establish a refined and professional tone. Pair with the paragraph font to create clear hierarchy and contrast. Maintain generous line spacing and letter spacing to enhance readability and elegance. Use 'primary' color for headings on light backgrounds and 'primaryForeground' on dark backgrounds to ensure accessibility.",
            "headingsAccessibilityNotes": "Headings using 'primary' color on 'secondary' or 'background' colors meet WCAG AA contrast standards. When placed on 'primary' backgrounds, use 'primaryForeground' to maintain sufficient contrast."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "nunito sans",
              "raleway",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, captions, and UI labels. It pairs well with the serif heading font to balance elegance with readability. Maintain consistent line height and moderate letter spacing for comfortable reading. Use 'secondaryForeground' color for text on 'secondary' and 'background' colors, and 'primaryForeground' for text on 'primary' backgrounds to ensure contrast.",
            "paragraphsAccessibilityNotes": "Paragraph text colors meet WCAG AA contrast ratios against their respective backgrounds, ensuring legibility for all users."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section typography is anchored in the top third of the viewport, using large, elegant serif headings paired with smaller sans-serif subheadings. This placement creates a strong visual hierarchy and immediate brand presence. The text is left-aligned with generous white space around it, allowing the typography to breathe and draw attention without overwhelming the user. The warm 'primary' color is used for headings to emphasize brand identity, while the background remains soft and neutral to maintain focus on the text."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.4",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.3",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.05em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.06em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Moderate Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid 'primary' color backgrounds for key sections and cards, with clean edges and subtle dividing lines in 'primary' color. Padding is consistent to maintain content clarity and separation. Background containers use the 'secondary' color to provide contrast and soften the overall look.",
          "images": "Images are presented in clean rectangular frames with no heavy borders, often aligned in grid or column layouts. They maintain natural colors and are balanced with ample white space to avoid clutter. Images do not interfere with the primary color scheme as they are visually separated by background colors.",
          "buttons": "Buttons use the 'primary' color for backgrounds with 'primaryForeground' text for strong call-to-action emphasis. Secondary buttons use transparent backgrounds with 'primary' colored borders and text. Button shapes are rectangular with subtle rounding, maintaining a modern and professional look."
        },
        "graphicElements": {
          "icons": "Icons are minimal line drawings in 'primary' color, consistent in stroke weight and style, supporting the clean and modern aesthetic without distraction.",
          "illustrations": "No prominent illustrations are present; the design relies on photography and minimal graphic elements to maintain professionalism and clarity.",
          "stickers": "No sticker or badge elements are used, keeping the design clean and focused on content and typography."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752408195106-Screenshot%202025-06-05%20at%2011.42.23.jpg"
      ]
    },
    {
      "presetId": "9fcae758-95a7-4545-9fbd-b80749c06532",
      "brandIdentity": {
        "designSummary": "This design features a minimalistic and refined aesthetic with a spacious, balanced layout. The color palette is dominated by a soft, warm off-white background paired with black and dark gray text for high contrast and readability. Typography plays a central role, combining large, bold, geometric sans-serif headings with delicate italic serif body text to create a sophisticated editorial tone. The layout uses generous white space and a modular grid with consistent margins and subtle rounded corners on images and cards, adding a modern yet approachable softness. UI elements are understated with thin borders and minimal fills, emphasizing clarity and elegance. Overall, the design conveys a timeless, high-end brand identity suitable for luxury products, focusing on simplicity, clarity, and subtle sophistication.",
        "toneOfVoice": "Sophisticated, minimalistic, elegant, and modern with a calm and refined personality.",
        "tones": [
          "calm",
          "sophisticated",
          "minimal",
          "elegant",
          "modern",
          "refined",
          "timeless",
          "clean",
          "balanced",
          "understated"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modern"
          ],
          "supportingStyles": [
            "Editorial",
            "Luxury"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#F7F5F0",
            "secondary": "#4A4A4A",
            "secondaryForeground": "#F7F5F0",
            "background": "#F7F5F0",
            "customColors": [
              {
                "name": "subtleborder",
                "value": "#D1CDC7"
              },
              {
                "name": "mutedgray",
                "value": "#B0B0B0"
              },
              {
                "name": "foreground",
                "value": "#4A4A4A"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary canvas to create a soft, warm environment that supports content without distraction. The 'primary' color is reserved for main text and headings to ensure maximum readability and strong visual hierarchy. The 'secondary' color is used for less prominent text and UI elements, providing subtle contrast without overpowering the primary text. The 'subtleBorder' color is ideal for delicate dividing lines and borders around interactive elements, maintaining the minimal aesthetic. The 'mutedGray' color can be used for secondary UI elements or placeholder text to add depth without breaking the calm tone. All colors should be combined to maintain high contrast and accessibility, with 'primary' text on 'background' for main content and 'secondary' for supporting text. Avoid using heavy fills or saturated colors to preserve the understated luxury feel.",
          "paletteAccessibilityNotes": "The 'primary' color on 'background' provides excellent contrast exceeding WCAG AA standards for all text sizes. The 'secondary' color on 'background' also meets WCAG AA contrast requirements for body text and UI elements. Borders and subtle UI accents using 'subtleBorder' and 'mutedGray' maintain sufficient contrast for visibility without overwhelming the design. Overall, the palette supports accessible reading and interaction while preserving the minimal and elegant aesthetic."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "avenir-lt-w01_85-heavy1475544",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "futura-lt-w01-book",
              "montserrat",
              "oswald"
            ],
            "headingsUsageGuide": "Use the heading font in large sizes with tight letter spacing to create strong visual impact and hierarchy. Headings should be uppercase or all caps for a clean, modern look. Pair headings with the serif paragraph font to create contrast and balance. Maintain generous spacing around headings to preserve the minimal aesthetic. Use the 'primary' color for headings to ensure maximum readability and emphasis.",
            "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' provide excellent contrast and meet WCAG AA standards for all sizes, ensuring clear readability and accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "baskervillemtw01-smbdit",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "playfair display",
              "didot-w01-italic",
              "cormorantgaramond-light"
            ],
            "paragraphsUsageGuide": "Use the paragraph font in smaller sizes with italic styling to add a refined, editorial tone. This font contrasts with the bold sans-serif headings, creating a balanced typographic hierarchy. Use the 'secondary' color for body text and captions to soften the visual weight while maintaining readability. Maintain ample line height and spacing to enhance legibility and preserve the airy feel of the layout.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'secondary' color on 'background' meets WCAG AA contrast requirements for body text, ensuring accessible reading while supporting the elegant design."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a two-column layout with large, bold headings occupying the left quadrant and a product image with rounded corners on the right quadrant. This placement balances visual weight between text and imagery, creating a harmonious and inviting introduction. The heading's large size and tight letter spacing draw immediate attention, while the image's soft edges and neutral background complement the typography. The generous white space around both elements enhances clarity and focus, reinforcing the minimal and elegant brand identity."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "600"
            },
            {
              "name": "xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "2xl",
              "size": "2rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "2.5rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.02em",
              "fontWeight": "800"
            },
            {
              "name": "4xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "900"
            },
            {
              "name": "6xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.05em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "5.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.08em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use generous padding and subtle borders in 'subtleBorder' color to define sections without heavy visual weight. Rounded corners soften container edges, maintaining the minimal and approachable feel. Backgrounds remain in 'background' color to preserve consistency.",
          "images": "Product images are presented with muted, neutral backgrounds in 'mutedGray' or similar tones, with rounded corners to soften the geometric layout. Images are large and clear, emphasizing product form and material without distraction.",
          "buttons": "Buttons are minimal with thin borders in 'primary' color and transparent backgrounds. Text inside buttons uses 'primary' color for clarity. On hover, buttons may invert colors or slightly darken the border to indicate interactivity while maintaining subtlety."
        },
        "graphicElements": {
          "icons": "Icons are line-based, minimal, and use the 'primary' color to maintain consistency with text and UI elements. They are simple and unobtrusive, supporting navigation and interaction without drawing excessive attention.",
          "illustrations": "No illustrations are used, keeping the focus on product photography and typography to maintain a clean and sophisticated look.",
          "stickers": "Stickers or badges, such as sale indicators, use subtle outlines in 'primary' color with italic serif text to blend with the editorial tone without disrupting the minimal aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750580630382-Screenshot%202025-06-22%20at%2011.23.45.png"
      ]
    }
  ],
  "brandBook": {
    "tones": [
      "Warm",
      "Trustworthy",
      "Sophisticated",
      "Inviting",
      "Calm",
      "Elegant",
      "Professional",
      "Approachable",
      "Clean",
      "Spacious"
    ],
    "designStyle": {
      "primaryStyle": [
        "Modern Classic",
        "Editorial"
      ],
      "supportingStyles": [
        "Minimalism",
        "Warm Naturalism"
      ]
    },
    "toneOfVoice": "warm, trustworthy, sophisticated, and inviting with a professional yet approachable personality.",
    "components": {
      "images": "Images are large, high-quality, and naturalistic, often spanning full width or large columns. They are framed by generous whitespace and rarely overlapped by text except in hero sections with semi-opaque overlays. The style is warm and inviting, supporting the brand's premium feel.",
      "buttons": "Buttons are solid blocks of the 'primary' color with 'primaryForeground' text, featuring clean edges and moderate padding. Secondary buttons use a subtle background or border with the 'primary' color for text or outlines. Buttons have clear hover states and are sized for easy interaction.",
      "containers": "Containers use soft background colors or subtle pastel blocks to separate content sections, maintaining a clean and elegant look. Borders are minimal or absent, relying on spacing and color contrast for separation. The 'background' color predominates, with custom pastel colors used sparingly for emphasis."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "Primary Heading Font",
          "fontFamily": "bitter",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use the 'bitter' font for all primary headings to convey elegance and professionalism. Headings should be large with generous line height and spacing to enhance readability and create a strong visual hierarchy. Pair headings with body text fonts that complement serif styles for balance. Use the 'secondary' color for headings to maintain contrast and brand consistency. Avoid overcrowding headings with excessive weight or size to preserve the clean aesthetic.",
        "headingsSimilarFonts": [
          "playfair display",
          "cormorantgaramond",
          "didot-w01-italic"
        ],
        "headingsAccessibilityNotes": "Headings in 'bitter' paired with the 'secondary' color on the 'background' color meet WCAG AA contrast standards, ensuring clear readability for users with visual impairments."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.2",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.6",
          "fontWeight": "600"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.6",
          "fontWeight": "600"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "0.035em",
          "lineHeight": "1.6",
          "fontWeight": "700"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "0.035em",
          "lineHeight": "1.6",
          "fontWeight": "700"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1.2",
          "fontWeight": "700"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1.2",
          "fontWeight": "700"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "0.045em",
          "lineHeight": "1.1",
          "fontWeight": "700"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "0.045em",
          "lineHeight": "1.1",
          "fontWeight": "700"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "0.05em",
          "lineHeight": "1",
          "fontWeight": "700"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "Main Body Text Font",
          "fontFamily": "raleway",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use the 'raleway' font for body text to maintain typographic harmony with headings. Body text should be set at a comfortable size with moderate line height for easy reading. Use the 'secondary' color for body text on the 'background' color to ensure sufficient contrast. Maintain consistent spacing between paragraphs and sections to support a clean, uncluttered layout. Avoid overly dense text blocks to preserve the spacious feel of the design.",
        "paragraphsSimilarFonts": [
          "noto",
          "open sans",
          "nunito sans"
        ],
        "paragraphsAccessibilityNotes": "Body text in 'raleway' with the 'secondary' color on the 'background' color meets WCAG AA contrast requirements, supporting accessibility for all users."
      },
      "welcomeSectionTypography": {
        "placement": "Top-Third Anchor",
        "implementation": "The welcome section typography is anchored in the top third of the hero image area, with large, elegant headings placed on a semi-opaque background block. This placement ensures immediate visual impact and readability against the photographic backdrop. The heading uses a large serif font with ample spacing, while the supporting text is smaller and more subdued, creating a clear hierarchy. The call-to-action button is positioned below the text block, using the 'primary' color to stand out. This approach balances visual prominence with clarity, guiding the user's focus naturally from headline to action."
      }
    },
    "originImagesUrls": [
      "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750574994718-Screenshot%202025-06-22%20at%209.49.48.png"
    ],
    "layout": {
      "grid": {
        "margins": "Generous page margins",
        "padding": "Consistent padding within containers",
        "spacing": {
          "gaps": "Consistent medium gaps",
          "rows": "Defined content rows",
          "columns": "12-column grid"
        },
        "compositionApproach": "Column-based"
      },
      "layoutDna": {
        "contrastSpectrum": "Moderate Contrast",
        "densitySpectrum": "Balanced",
        "textVsImageEmphasis": "Balanced",
        "complexitySpectrum": "Simple & Clean",
        "gridAlignmentSpectrum": "Modular",
        "negativeSpaceUsage": "Generous"
      }
    },
    "graphicElements": {
      "icons": "Icons are minimal, line-based, and use the 'secondary' color to maintain subtlety and elegance. They support navigation and UI without drawing excessive attention.",
      "stickers": "No stickers or badges are present, preserving the clean and professional aesthetic.",
      "illustrations": "No prominent illustrations are used, maintaining a photographic and realistic visual style."
    },
    "designSummary": "This design features a modern classic aesthetic with editorial influences, characterized by a clean, spacious layout and a warm, earthy color palette. The primary colors include a rich burnt orange and deep brown, paired with soft off-white backgrounds and subtle pastel accents. Typography is dominated by elegant serif fonts for headings and complementary serif or serif-inspired fonts for body text, creating a refined and readable hierarchy. The layout employs generous whitespace, modular grids, and balanced text-image relationships, fostering a calm and uncluttered user experience. UI components such as buttons and containers use solid, warm colors to highlight calls to action while maintaining a minimalist and sophisticated style. Overall, the design conveys quality, trust, and comfort, making it adaptable for various premium industries.",
    "palette": {
      "colors": {
        "background": "#F9F5F0",
        "secondary": "#4A2C23",
        "customColors": [
          {
            "name": "pastellavender",
            "value": "#D6D0DD"
          },
          {
            "name": "pastelbeige",
            "value": "#E6D6C4"
          },
          {
            "name": "pastelgreen",
            "value": "#DCE6CD"
          },
          {
            "name": "pastelpeach",
            "value": "#F7BFA6"
          },
          {
            "name": "foreground",
            "value": "#4A2C23"
          },
          {
            "name": "destructive",
            "value": "#DF3131"
          },
          {
            "name": "destructiveforeground",
            "value": "#FFFFFF"
          }
        ],
        "secondaryForeground": "#F9F5F0",
        "primaryForeground": "#FFFFFF",
        "primary": "#B94A1F"
      },
      "paletteUsageGuide": "Use the 'primary' color for key interactive elements such as buttons, links, and highlights to draw user attention effectively. The 'primaryForeground' color ensures text and icons on 'primary' backgrounds remain highly legible. The 'secondary' color is ideal for headings, subheadings, and important text elements, paired with 'secondaryForeground' for contrast and readability. The 'background' color provides a soft, neutral canvas that supports content without distraction. The custom colors 'pastelLavender', 'pastelBeige', 'pastelGreen', and 'pastelPeach' serve as subtle accent blocks or backgrounds for data visualization and highlight sections, adding warmth and variety while maintaining harmony with the core palette. These colors should be used sparingly to maintain a clean and sophisticated look. Overall, the palette balances warmth and professionalism, ensuring accessibility and visual comfort across the site.",
      "paletteAccessibilityNotes": "The 'primary' color on 'primaryForeground' (white) meets WCAG AA and AAA contrast standards for text and UI elements, ensuring readability. The 'secondary' color on 'secondaryForeground' also meets WCAG AA contrast ratios for headings and important text. The 'background' color provides sufficient contrast with both 'primary' and 'secondary' text colors for body content. Custom pastel colors have moderate contrast and are best used for large text or non-critical UI elements to maintain accessibility. Overall, the palette supports strong visual hierarchy and accessibility compliance."
    }
  },
  "initialPrompt": "A website for a company called LegalAssist that offers legal services from licensed paralegals. Include all the categories that paralegals in Ontario can practice in, and go into detail.",
  "status": "READY",
  "revision": "11",
  "createdDate": "2025-12-15T04:00:29.159Z",
  "updatedDate": "2025-12-15T04:01:48.433Z",
  "attachments": {
    "contentImagesUrls": [],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "0079631d-84b2-4f48-9303-aab170f0220b",
  "plan": "{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This plan outlines a website for LegalAssist, a company providing legal services through licensed paralegals. The site will feature a homepage, a detailed listing of paralegal practice categories in Ontario, and the ability to filter and view specific category details.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **View Homepage Content**: Displays introductory information about LegalAssist and its services.\\n- **View Legal Service Categories Listing**: Lists all the practice areas that licensed paralegals in Ontario can cover.\\n- **Filter Legal Service Categories**: Allows users to filter the list of practice areas.\\n- **View Legal Service Category Details**: Provides in-depth information for each specific paralegal practice category.\",\n      \"metadata\": [\n        { \"id\": \"view-homepage-content\", \"name\": \"View Homepage Content\" },\n        { \"id\": \"view-legal-service-categories-listing\", \"name\": \"View Legal Service Categories Listing\" },\n        { \"id\": \"filter-legal-service-categories\", \"name\": \"Filter Legal Service Categories\" },\n        { \"id\": \"view-legal-service-category-details\", \"name\": \"View Legal Service Category Details\" }\n      ]\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Header (Reusable)**: Contains the LegalAssist logo and navigation links to Home and Legal Services.\\n- **Footer (Reusable)**: Contains contact information and copyright details.\\n- **Homepage**: Hosts the introductory content for LegalAssist.\\n- **Legal Services Page**: Displays the list of paralegal practice categories, with filtering and detail views.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"view-homepage-content\", \"name\": \"View Homepage Content\" },\n        { \"id\": \"view-legal-service-categories-listing\", \"name\": \"View Legal Service Categories Listing\" },\n        { \"id\": \"filter-legal-service-categories\", \"name\": \"Filter Legal Service Categories\" },\n        { \"id\": \"view-legal-service-category-details\", \"name\": \"View Legal Service Category Details\" }\n      ]\n    }\n  ],\n  \"version\": \"3.0\"\n}",
  "designerData": {
    "designerId": "45d286a9-c2d3-4558-807d-a3f26205dc86",
    "designerName": "Elise",
    "selectionMethod": "UNSELECTED"
  }
}